Revit 2024 API
BuiltInFailures.StairRampFailures.BalustersTooClose Property
 Baluster Separation must be equal to or greater than the Baluster widths.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Syntax
C#
public static FailureDefinitionId BalustersTooClose { get; }
Visual Basic
Public Shared ReadOnly Property BalustersTooClose As FailureDefinitionId
	Get
Visual C++
public:
static property FailureDefinitionId^ BalustersTooClose {
	FailureDefinitionId^ get ();
}
See Also
BuiltInFailures.StairRampFailures Class
Autodesk.Revit.DB Namespace